#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_cosmosdb_mongo_collection.ngc will be updated in-place
  ~ resource "azurerm_cosmosdb_mongo_collection" "ngc" {
        account_name        = "nextgenconf"
        database_name       = "SessionsDb"
      ~ default_ttl_seconds = 0 -> -1
        id                  = "/subscriptions/b087ec80-bbdd-4b0a-9fb3-ca2eb729208c/resourceGroups/ngc/providers/Microsoft.DocumentDB/databaseAccounts/nextgenconf/apis/mongodb/databases/SessionsDb/collections/Sessions"
        name                = "Sessions"
        resource_group_name = "ngc"
        shard_key           = "_id"
      ~ throughput          = 1000 -> 400
    }

  # azurerm_cosmosdb_mongo_collection.ngc_conference will be updated in-place
  ~ resource "azurerm_cosmosdb_mongo_collection" "ngc_conference" {
        account_name        = "nextgenconf"
        database_name       = "ConferenceDb"
      ~ default_ttl_seconds = 0 -> -1
        id                  = "/subscriptions/b087ec80-bbdd-4b0a-9fb3-ca2eb729208c/resourceGroups/ngc/providers/Microsoft.DocumentDB/databaseAccounts/nextgenconf/apis/mongodb/databases/ConferenceDb/collections/Conferences"
        name                = "Conferences"
        resource_group_name = "ngc"
        shard_key           = "_id"
      ~ throughput          = 1000 -> 400
    }

  # azurerm_cosmosdb_mongo_collection.ngc_profile will be updated in-place
  ~ resource "azurerm_cosmosdb_mongo_collection" "ngc_profile" {
        account_name        = "nextgenconf"
        database_name       = "ProfileDb"
      ~ default_ttl_seconds = 0 -> -1
        id                  = "/subscriptions/b087ec80-bbdd-4b0a-9fb3-ca2eb729208c/resourceGroups/ngc/providers/Microsoft.DocumentDB/databaseAccounts/nextgenconf/apis/mongodb/databases/ProfileDb/collections/Profiles"
        name                = "Profiles"
        resource_group_name = "ngc"
        shard_key           = "_id"
        throughput          = 400
    }

  # github_repository.repository_api_gateway must be replaced
-/+ resource "github_repository" "repository_api_gateway" {
      ~ allow_merge_commit = false -> true
      ~ allow_rebase_merge = false -> true
      ~ allow_squash_merge = false -> true
        archived           = false
      ~ default_branch     = "master" -> (known after apply)
        description        = "Microservice for aggregating requests to storage services"
      ~ etag               = "W/\"474c4880c3dcd0edab0f7883e83ce6db\"" -> (known after apply)
      ~ full_name          = "cloud-native-conference/ApiGateway" -> (known after apply)
      ~ git_clone_url      = "git://github.com/cloud-native-conference/ApiGateway.git" -> (known after apply)
      - has_downloads      = false -> null
        has_issues         = true
        has_projects       = false
      - has_wiki           = false -> null
      ~ html_url           = "https://github.com/cloud-native-conference/ApiGateway" -> (known after apply)
      ~ http_clone_url     = "https://github.com/cloud-native-conference/ApiGateway.git" -> (known after apply)
      ~ id                 = "ApiGateway" -> (known after apply)
      - license_template   = "mit" -> null # forces replacement
        name               = "ApiGateway"
      - private            = false -> null
      ~ ssh_clone_url      = "git@github.com:cloud-native-conference/ApiGateway.git" -> (known after apply)
      ~ svn_url            = "https://github.com/cloud-native-conference/ApiGateway" -> (known after apply)
      - topics             = [] -> null
    }

  # github_repository.repository_conference_service will be updated in-place
  ~ resource "github_repository" "repository_conference_service" {
      ~ allow_merge_commit = false -> true
      ~ allow_rebase_merge = false -> true
      ~ allow_squash_merge = false -> true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "Microservice for storing conferences"
        etag               = "W/\"6ca841ab0a2c926e5895cd3bb9d0b5f7\""
        full_name          = "cloud-native-conference/ConferenceService"
        git_clone_url      = "git://github.com/cloud-native-conference/ConferenceService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/cloud-native-conference/ConferenceService"
        http_clone_url     = "https://github.com/cloud-native-conference/ConferenceService.git"
        id                 = "ConferenceService"
        name               = "ConferenceService"
        private            = false
        ssh_clone_url      = "git@github.com:cloud-native-conference/ConferenceService.git"
        svn_url            = "https://github.com/cloud-native-conference/ConferenceService"
      - topics             = [] -> null
    }

  # github_repository.repository_conference_session_service must be replaced
-/+ resource "github_repository" "repository_conference_session_service" {
      ~ allow_merge_commit = false -> true
      ~ allow_rebase_merge = false -> true
      ~ allow_squash_merge = false -> true
        archived           = false
      ~ default_branch     = "master" -> (known after apply)
        description        = "Microservice for storing the relationship between conferences and sessions"
      ~ etag               = "W/\"3686cb19aceef609973cc011ea12c44d\"" -> (known after apply)
      ~ full_name          = "cloud-native-conference/ConferenceSessionService" -> (known after apply)
      ~ git_clone_url      = "git://github.com/cloud-native-conference/ConferenceSessionService.git" -> (known after apply)
      - has_downloads      = false -> null
        has_issues         = true
        has_projects       = false
      - has_wiki           = false -> null
      ~ html_url           = "https://github.com/cloud-native-conference/ConferenceSessionService" -> (known after apply)
      ~ http_clone_url     = "https://github.com/cloud-native-conference/ConferenceSessionService.git" -> (known after apply)
      ~ id                 = "ConferenceSessionService" -> (known after apply)
      - license_template   = "mit" -> null # forces replacement
        name               = "ConferenceSessionService"
      - private            = false -> null
      ~ ssh_clone_url      = "git@github.com:cloud-native-conference/ConferenceSessionService.git" -> (known after apply)
      ~ svn_url            = "https://github.com/cloud-native-conference/ConferenceSessionService" -> (known after apply)
      - topics             = [] -> null
    }

  # github_repository.repository_feed_service will be updated in-place
  ~ resource "github_repository" "repository_feed_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing conference feeds"
        etag               = "W/\"94cad08f18ba70c15ef570a1890d3191\""
        full_name          = "cloud-native-conference/FeedService"
        git_clone_url      = "git://github.com/cloud-native-conference/FeedService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/cloud-native-conference/FeedService"
        http_clone_url     = "https://github.com/cloud-native-conference/FeedService.git"
        id                 = "FeedService"
        license_template   = "mit"
        name               = "FeedService"
        private            = false
        ssh_clone_url      = "git@github.com:cloud-native-conference/FeedService.git"
        svn_url            = "https://github.com/cloud-native-conference/FeedService"
      - topics             = [] -> null
    }

  # github_repository.repository_k8s_config must be replaced
-/+ resource "github_repository" "repository_k8s_config" {
      ~ allow_merge_commit = false -> true
      ~ allow_rebase_merge = false -> true
      ~ allow_squash_merge = false -> true
        archived           = false
      ~ default_branch     = "master" -> (known after apply)
        description        = "Repository containing the kubernetes resource files for the NextGenConf cluster"
      ~ etag               = "W/\"1904f033087b8461e6952e42a40f6ac0\"" -> (known after apply)
      ~ full_name          = "cloud-native-conference/KubeConfig" -> (known after apply)
      ~ git_clone_url      = "git://github.com/cloud-native-conference/KubeConfig.git" -> (known after apply)
      - has_downloads      = false -> null
        has_issues         = true
        has_projects       = false
      - has_wiki           = false -> null
      ~ html_url           = "https://github.com/cloud-native-conference/KubeConfig" -> (known after apply)
      ~ http_clone_url     = "https://github.com/cloud-native-conference/KubeConfig.git" -> (known after apply)
      ~ id                 = "KubeConfig" -> (known after apply)
      - license_template   = "mit" -> null # forces replacement
        name               = "KubeConfig"
      - private            = false -> null
      ~ ssh_clone_url      = "git@github.com:cloud-native-conference/KubeConfig.git" -> (known after apply)
      ~ svn_url            = "https://github.com/cloud-native-conference/KubeConfig" -> (known after apply)
    }

  # github_repository.repository_session_service must be replaced
-/+ resource "github_repository" "repository_session_service" {
      ~ allow_merge_commit = false -> true
      ~ allow_rebase_merge = false -> true
      ~ allow_squash_merge = false -> true
        archived           = false
      ~ default_branch     = "master" -> (known after apply)
        description        = "Microservice for storing conference sessions"
      ~ etag               = "W/\"1875c27de6c149bea657a6d618d722be\"" -> (known after apply)
      ~ full_name          = "cloud-native-conference/SessionService" -> (known after apply)
      ~ git_clone_url      = "git://github.com/cloud-native-conference/SessionService.git" -> (known after apply)
      - has_downloads      = false -> null
        has_issues         = true
        has_projects       = false
      - has_wiki           = false -> null
      ~ html_url           = "https://github.com/cloud-native-conference/SessionService" -> (known after apply)
      ~ http_clone_url     = "https://github.com/cloud-native-conference/SessionService.git" -> (known after apply)
      ~ id                 = "SessionService" -> (known after apply)
      - license_template   = "mit" -> null # forces replacement
        name               = "SessionService"
      - private            = false -> null
      ~ ssh_clone_url      = "git@github.com:cloud-native-conference/SessionService.git" -> (known after apply)
      ~ svn_url            = "https://github.com/cloud-native-conference/SessionService" -> (known after apply)
      - topics             = [] -> null
    }

  # github_repository.repository_web_app will be updated in-place
  ~ resource "github_repository" "repository_web_app" {
      ~ allow_merge_commit = false -> true
      ~ allow_rebase_merge = false -> true
      ~ allow_squash_merge = false -> true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "React app displaying conferences"
        etag               = "W/\"d52280da580821c9db3c7d47bb9bb14d\""
        full_name          = "cloud-native-conference/WebApp"
        git_clone_url      = "git://github.com/cloud-native-conference/WebApp.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/cloud-native-conference/WebApp"
        http_clone_url     = "https://github.com/cloud-native-conference/WebApp.git"
        id                 = "WebApp"
        name               = "WebApp"
        private            = false
        ssh_clone_url      = "git@github.com:cloud-native-conference/WebApp.git"
        svn_url            = "https://github.com/cloud-native-conference/WebApp"
      - topics             = [] -> null
    }

Plan: 4 to add, 6 to change, 4 to destroy.
```

</details>

*Workflow: `ci pr`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
